{
    "name": "Brevis coChain",
    "published": false,
    "research": [
      {
        "author": "tokensight",
        "title": "Tokensight | Brevis coChain: AVS Cryptoeconomic Risk Analysis",
        "url": "https://paragraph.xyz/@tokensightxyz/brevis-cochain-avs-cryptoeconomic-risk-analysis"
      }
    ],
    "riskAnalysis": {
      "sections": [
        {
          "category": "AVS",
          "risks": [
            {
              "name": "Business Model",
              "elements": [
                {
                  "description": "Pure Wallet",
                  "risk": "low",
                  "comment": "\"Pure Wallet\" is an EigenLayer AVS business model (the most secure one for newborn protocols) where no native AVS token is involved, and user fees are paid in a purely neutral denomination (like ETH). <i>Currently, it appears that Pure Wallet is the model adopted by Brevis, though further details are lacking</i>."
                }
              ]
            },
            {
              "name": "Protocol Security",
              "elements": [
                {
                  "description": "Code Audits & GitHub Code Coverage",
                  "comment": "One code audit has been performed. GitHub code coverage percentage has not been publicly disclosed.",
                  "risk": "medium",
                  "links": [
                    {
                      "label": "view audit",
                      "href": "https://github.com/brevis-network/brevis-contracts-avs/blob/main/audit/SlowMist%20Audit%20Report%20-%20Brevis%20Contracts%20AVS.pdf"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Operator Profile",
              "elements": [
                {
                  "description": "Reputation & Entrenchment Status",
                  "risk": "high",
                  "comment": "Since we are at the very early stages of EigenLayer, operators' reputation was classified as unknown, given the lack of a track record. Operator's entrenchment level indicates how entrenched Brevis ZK Coprocessor's operators are on other AVSs — the small number of AVSs currently live helps exacerbate this risk, in a pooled security context. <br><br><i>All AVSs are assigned a high operator profile risk at this early stage.</i>",
                  "links": [
                    {
                      "label": "view full operator list",
                      "href": "https://app.eigenlayer.xyz/avs/0x9fc952bdcbb7daca7d420fa55b942405b073a89d"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "category": "Brevis coChain ZK Coprocessor Protocol",
          "risks": [
            {
              "name": "ZK Coprocessor",
              "elements": [
                {
                  "description": "Proof & Query Processing Security",
                  "risk": "low",
                  "comment": "Brevis coChain enables smart contracts to trustlessly access full historical on-chain data from different chains. dApp developers can build and deploy customized queries using Brevis's SDK, which runs computations and generates off-chain ZK proofs. The query results, along with the ZK proofs, are submitted back on-chain for dApps' smart contracts to verify and consume. <br><br><i>Aided by restaked pooled security, advanced ZK cryptographic algorithms, and large-scale parallelization, Brevis is able to process trustless queries securely and at high throughput.</i>"
                }
              ]
            },
            {
              "name": "Prover Network Profile",
              "elements": [
                {
                  "description": "Decentralization & Security Status",
                  "comment": "Brevis' Prover Network ensures the generation of ZK Consensus Proofs trustlessly and in-house, eliminating the need for validation from a third-party. Its security and consensus are fully and solely derived from the underlying blockchains and, subsequently, the cryptographically-sound proofs outputted by the network.<br><br>Even in the case of a 2/3 stake attack toward the Prover network, ZK-proof generation is not affected; only slight liveness issues may occur.<br><br><i>In a pure zero-knowledge system like Brevis, consensus is achieved internally through the generation of the ZK Consensus Proofs, making it an extremely airtight system against potential safety faults.<br><br>Degree of decentralization of the Prover network is unknown.</i>",
                  "risk": "low"
                }
              ]
            }
          ]
        }
      ]
    }
  }
  