{
  "name": "EigenDA",
  "published": false,
  "research": [
    {
      "author": "tokensight",
      "title": "Tokensight | EigenDA: Cryptoeconomic Risk Analysis",
      "url": "https://paragraph.xyz/@tokensightxyz/eigenda-avs-cryptoeconomic-risk-analysis"
    },
    {
      "author": "EigenLayer",
      "title": "EigenLayer | Intro to EigenDA",
      "url": "https://www.blog.eigenlayer.xyz/intro-to-eigenda-hyperscale-data-availability-for-rollups/"
    }
  ],
  "riskAnalysis": {
    "sections": [
      {
        "category": "AVS",
        "risks": [
          {
            "name": "Business Model",
            "elements": [
              {
                "description": "Dual Staking + Rollup Custom Quorum",
                "risk": "low",
                "comment": "EigenDA uses Dual Staking of ETH and EIGEN, where EIGEN stakers can be forked for data availability assurances. Rollups are also allowed to integrate their own token quorum so that DA commitments are validated by both the default EigenDA quorum and the custom rollup quorum. <br><br>While native rollup staked tokens and the unknown DeFi risk profile of EIGEN may introduce moderate initial risks, the strong quorum composition and the ability to soon slash intersubjective faults establish a robust business model, where all quorums must be compromised in order for EigenDA to fail, which appears challenging to execute. <br><br><i>Being mindful in setting a biased staking balance in favor of ETH is strongly advised for added security, particularly at the early stage of an AVS.</i>"
              }
            ]
          },
          {
            "name": "Protocol Security",
            "elements": [
              {
                "description": "Code Audits & GitHub Code Coverage",
                "comment": "One <a href=\"https://github.com/Layr-Labs/eigenlayer-middleware/tree/dev/audits\">code audit</a> performed by one entity only. <br><br>Code coverage percentage measures the extent of EigenDA code tested by automated tests, calculated as the ratio of tested lines or branches to the total in the codebase. Higher percentages suggest more comprehensive testing and a reduced likelihood of latent bugs in EigenDA. It sits at around <b>55%</b>, as of 11/18/2024.",
                "links": [
                  {
                    "label": "view github",
                    "href": "https://github.com/Layr-Labs/eigenda"
                  }
                ],
                "risk": "medium"
              }
            ]
          },
          {
            "name": "Operator Profile",
            "elements": [
              {
                "description": "Reputation & Entrenchment Status",
                "risk": "high",
                "comment": "Since we are at the very early stages of EigenLayer, operators' performance reputation was classified as unknown. Operator's entrenchment level indicates how entrenched EigenDA's operators are validating other AVSs. The small number of AVSs currently live helps exacerbate this risk, in a pooled security context. <br><br><i>All AVSs are assigned a high operator profile risk at this early stage.</i>",
                "links": [
                  {
                    "label": "view full operator list",
                    "href": "https://app.eigenlayer.xyz/avs/0x870679e138bcdf293b7ff14dd44b70fc97e12fc0"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "category": "EigenDA Protocol",
        "risks": [
          {
            "name": "Rollups",
            "elements": [
              {
                "description": "Blob Sequencer Decentralization & Bandwidth Reservation",
                "risk": "low",
                "comment": "EigenDA allows rollup nodes to interact directly with a majority of EigenDA nodes, alleviating centralization pressures by bypassing the need for a single leader to order the data. Existing solutions rely on a single leader to sequence blobs, introducing a potential censorship chokepoint. <br><br>Furthermore, rollups on EigenDA can now reserve a chunk of bandwidth (1MB/s, e.g), helping alleviate current data congestion issues, surge pricing, and fluctuating gas fees — throughput is greatly increased as a result."
              }
            ]
          },
          {
            "name": "Disperser",
            "elements": [
              {
                "description": "Disperser Communication & Security Status",
                "comment": "EigenDA's Disperser sends blobs straight to its operators through direct communication (unicast). In traditional methods, operators receive data blobs from peers and re-broadcast them to others, impacting liveness. Furthermore, the Disperser is built on KZG commitments and multi-reveal proofs rather than fraud proofs, making it possible to instantly verify correctness of coding. <br><br>Disperser permissionlessness and DAS (data availability sampling) for data verifiability are next in the roadmap. Currently, EigenDA uses a single permissioned Disperser to send data to its nodes, causing a liveness bottleneck. Once permissionless payments go live, the Disperser will be made permissionless, allowing any rollup sequencer to operate its own. Additionally, its usage of KZG polynomial coding ensures compatibility with DAS, to enhance verifiability, on a next release. <br><br>For more details, check <a href=\"https://eigenda.wtf/\">eigenda.wtf</a> and its blob explorer <a href=\"https://blobs.eigenda.xyz/\">here</a>.",
                "risk": "medium"
              }
            ]
          },
          {
            "name": "BFT Validator Profile",
            "elements": [
              {
                "description": "Decentralization & Security Status",
                "risk": "low",
                "comment": "BFT consensus imposes minimum thresholds of 1/3 and 2/3 validator agreement for liveness and safety guarantees, respectively. <br><br>EigenDA has introduced new low node requirements to promote decentralization and increased throughput. The minimum node requirement for validator participation is only 0.5MB/s (three orders of magnitude lower than current standards); the more stake delegated, the more node bandwidth becomes available. <br><br><i>At scale, TEE and DVT would potentially still be worth considering.</i>"
              }
            ]
          }
        ]
      }
    ]
  }
}
