{
    "name": "eoracle",
    "published": false,
    "riskAnalysis": {
      "sections": [
        {
          "category": "AVS",
          "risks": [
            {
              "name": "Business Model",
              "elements": [
                {
                  "description": "Dual Staking",
                  "risk": "low",
                  "comment": "eOracle employs Dual Staking of both ETH and its native token (TBD), featuring a Dual Quorum: ETH quorum + Native Token quorum. Both quorums must be compromised for the AVS to fail. <br><br>Dual Staking constitutes a reduced risk business model as it relies on both ETH restakers and native token stakers for objective and (soon) intersubjective slashing scenarios. The Pure Wallet model (restaked ETH solo) on its own may appear as the safest option, although it lacks the virtue of addressing potential intersubjective punishments, enforced through the AVS sovereign token. <br><br><i>Being mindful in setting a biased staking balance in favor of ETH for greater security is greatly advised, particularly at the early stages of an AVS.</i>"
                }
              ]
            },
            {
              "name": "Protocol Security",
              "elements": [
                {
                  "description": "Code Audits & Code Coverage",
                  "comment": "8 audits performed by 4 separate entities. <i>Although an overly quantitative metric, different entities performing audits attests to the high security of the protocol.</i> <br><br>The code coverage for this AVS is very high, although not publicly disclosed. <br><br>The code complexity of the protocol is deemed to be high.",
                  "links": [
                    {
                      "label": "view github",
                      "href": "https://github.com/Eoracle"
                    }
                  ],
                  "risk": "low"
                }
              ]
            },
            {
              "name": "Operator Profile",
              "elements": [
                {
                  "description": "Reputation & Entrenchment Status",
                  "risk": "high",
                  "comment": "Since we are at the very early stages of EigenLayer, operators' performance reputation was classified as unknown. Operator's entrenchment level indicates how entrenched eOracle's operators are validating other AVSs. The small number of AVSs currently live helps exacerbate this risk, in a pooled security context. <br><br><i>All AVSs are assigned a high operator profile risk at this early stage.</i>",
                  "links": [
                    {
                      "label": "view full operator list",
                      "href": "https://app.eigenlayer.xyz/avs/0x23221c5bb90c7c57ecc1e75513e2e4257673f0ef"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "category": "eOracle Protocol",
          "risks": [
            {
              "name": "Data Validators",
              "elements": [
                {
                  "description": "Data Reporting Security",
                  "risk": "low",
                  "comment": "Data validators ensure network integrity by collecting and reporting accurate and timely data, secured through cryptographic proofs (including threshold-BLS signatures). Their performance is tied to a system of rewards and penalties, including slashing for misbehavior. <br><br>eOracle uses a wide range of established third-party data providers, minimizing the probability of single points of failure and reducing risks of collusion. <br><br><i>Features to improve privacy and security across the whole data workflow, like TLS, are being actively researched by the eOracle team.</i>"
                }
              ]
            },
            {
              "name": "Chain Validators (Execution Layer)",
              "elements": [
                {
                  "description": "Data Processing & Verification",
                  "comment": "Chain validators run EO-chain (eOracle’s dedicated chain) software, processing transactions from Data Validators and enabling smart contracts to validate and aggregate data. They store cryptographic proofs of actions on the EO-chain for public access, while ensuring neutral aggregation and cryptographic validation; acting as a transparent data and settlement layer, the EO-chain handles off-chain observations and on-chain verification. <br><br>EO-chain’s architecture (in section below) provides full transparency, immutability of records, and a decentralized incentive structure while offloading computation from target chains.",
                  "risk": "low"
                }
              ]
            },
            {
              "name": "eBFT (Consensus Layer)",
              "elements": [
                {
                  "description": "Finality and Security Architecture",
                  "risk": "low",
                  "comment": "EO-chain is an independent PoS blockchain operated by EigenLayer operators. It uses eBFT as the consensus mechanism, which is based on BFT consensus principles, imposing the traditional minimum thresholds of 1/3 and 2/3 validator agreement for liveness and safety guarantees. <br><br>eBFT is built to enable permissionless validator selection, frequent block proposer rotation over time (Tendermint), immediate block finality, reduced latency in block production and execution, and high data integrity and fault tolerance. <br><br><i>At scale, TEE and DVT would potentially be worth considering.</i>"
                }
              ]
            }
          ]
        }
      ]
    }
  }
  