{
  "name": "Lagrange Labs",
  "published": false,
  "research": [
    {
      "author": "tokensight",
      "title": "Tokensight | Lagrange Labs: A Cryptoeconomic Risk Analysis",
      "url": "https://paragraph.xyz/@tokensightxyz/lagrange-cryptoeconomic-risk-analysis"
    }
  ],
  "riskAnalysis": {
    "sections": [
      {
        "category": "AVS",
        "risks": [
          {
            "name": "Business Model",
            "elements": [
              {
                "description": "Pure Wallet",
                "risk": "low",
                "comment": "\"Pure Wallet\" is an EigenLayer AVS business model (the most secure one for newborn protocols) where no native AVS token is involved, and user fees are paid in a purely neutral denomination (like ETH)."
              }
            ]
          },
          {
            "name": "Protocol Security",
            "elements": [
              {
                "description": "Code Audits & GitHub Code Coverage",
                "comment": "Three successive audits performed by one entity. <i>Although an overly qualitative metric, different entities performing audits would be advised.</i> <br><br>The code coverage for this AVS is very high.",
                "links": [
                  {
                    "label": "view audits",
                    "href": "https://github.com/Lagrange-Labs/lagrange-contracts/tree/develop/audits"
                  }
                ],
                "risk": "low"
              }
            ]
          },
          {
            "name": "Operator Profile",
            "elements": [
              {
                "description": "Reputation & Entrenchment Status",
                "risk": "high",
                "comment": "Since we are at the very early stages of EigenLayer, operators' reputation was classified as unknown. Operator's entrenchment level indicates how entrenched Lagrange State Committees' operators are on other AVSs. The small number of AVSs currently live helps exacerbate this risk, in a pooled security context. <br><br><i>All AVSs will be assigned a high risk category at this early stage.</i>",
                "links": [
                  {
                    "label": "view full operator list",
                    "href": "https://app.eigenlayer.xyz/avs/0x35f4f28a8d3ff20eed10e087e8f96ea2641e6aa2"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "category": "Lagrange State Committees Protocol",
        "risks": [
          {
            "name": "Committee State Proofs Security",
            "elements": [
              {
                "description": "Security of State Proof Generation",
                "risk": "low",
                "comment": "Any given Committee is designed to securely and provably generate cross-chain state proofs for optimistic rollups. It requires and generates inductive ZK proofs where validations are performed toward previous blocks and aggregated BLS signatures are generated to attest to the validity of the present block’s state. <i>All these combined attributes make the system extremely robust against faults</i>.<br><br><i>BLS signatures can be expensive to compute at scale. A more efficient and specialized signature scheme would be worth considering.</i>"
              }
            ]
          },
          {
            "name": "Prover Network Profile",
            "elements": [
              {
                "description": "Decentralization & Security Status",
                "comment": "At least 2/3 of the present Committee must correctly sign each block. The recursive nature of State Committees enables them to ensure continuous proof validity and cross-chain relaying.<br><br>Similarly to Lagrange’s ZK Coprocessor, even in the case of a 2/3 stake attack toward the Prover network, ZK-state proof generation is not affected; only slight liveness issues may occur.<br><br><i>Being structured as a pure ZK system, Lagrange State Committees are extremely airtight toward potential safety exploits.<br><br>Degree of decentralization in the sequencer and the overall Prover network are unknown.</i>",
                "risk": "low"
              }
            ]
          }
        ]
      }
    ]
  }
}
