{
  "name": "Omni Network",
  "published": false,
  "research": [
    {
      "author": "tokensight",
      "title": "Tokensight | Omni Network: A Cryptoeconomic Risk Analysis",
      "url": "https://paragraph.xyz/@tokensightxyz/omni-a-cryptoeconomic-analysis"
    }
  ],
  "riskAnalysis": {
    "sections": [
      {
        "category": "AVS",
        "risks": [
          {
            "name": "Business Model",
            "elements": [
              {
                "description": "Dual Staking + Dual Quorum",
                "risk": "medium",
                "comment": "Dual Staking involves moderate risk as it relies on both ETH restakers and OMNI native token stakers, adding complexity to token security and value dynamics. Omni features a Dual Quorum system, where two independent quorums (ETH quorum + Omni quorum) attest to the accurate relaying of messages. Both quorums must be compromised for Omni to fail."
              }
            ]
          },
          {
            "name": "Protocol Security",
            "elements": [
              {
                "description": "Code Audits & GitHub Code Coverage",
                "comment": "Unknown number of audits performed and unknown GitHub code coverage percentage.<br><br>Only disclaimer on protocol security is the setup of a bug bounty program.",
                "links": [
                  {
                    "label": "view github",
                    "href": "https://github.com/omni-network/omni/blob/main/SECURITY.md"
                  }
                ],
                "risk": "unknown"
              }
            ]
          },
          {
            "name": "Operator Profile",
            "elements": [
              {
                "description": "Reputation & Entrenchment Status",
                "risk": "high",
                "comment": "Since we are at the very early stages of EigenLayer, operators' reputation was classified as unknown. Operator's entrenchment level indicates how entrenched EigenDA's operators are on other AVSs. The small number of AVSs currently live helps exacerbate this risk, in a pooled security context."
              }
            ]
          }
        ]
      },
      {
        "category": "Omni",
        "risks": [
          {
            "name": "Execution Layer",
            "elements": [
              {
                "description": "Omni EVM Engine Health",
                "comment": "Omni’s EVM integrates an anti-Sybil mechanism to deter against the submission of malicious or spammy transactions. Additionally, it has complete equivalence with external applications, through an ABCI++ integration along Ethereum's Engine API, smoothing out susceptibility to bug issues.<br><br><i>Pursuing transaction encryption on its mempool should be considered for increased security and privacy in XMsg processing.</i>",
                "risk": "low"
              }
            ]
          },
          {
            "name": "Relayer",
            "elements": [
              {
                "description": "Relayer Security Status",
                "comment": "The Relayer generates Merkle multi-proofs for efficient XBlock submission and verification.<br><br>Unknown details regarding the Relayer’s permissionless and centralization. Currently, there is no track record of the Relayer’s performance in submitting XMsgs to destination chains.<br><br><i>A DA solution is recommended to address complex verification and increased computational cost of validator signatures and Merkle multi-proofs at scale.</i>",
                "risk": "medium"
              }
            ]
          },
          {
            "name": "CometBFT Validator Profile",
            "elements": [
              {
                "description": "Decentralization & Security Status",
                "risk": "medium",
                "comment": "CometBFT is adopted as the battle-tested, sub-second finality BFT mechanism, ensuring liveness within the network. It uses ABCI++, an advanced version of the Application Blockchain Interface, which supports and improves application compatibility, thereby reducing bug susceptibility and network latency.<br><br><i>TEE, DVT, shared sequencing, and pre-confirmation solutions for more secure XMsg cross-rollup fast-finality would all be worth considering.</i>"
              }
            ]
          }
        ]
      }
    ]
  }
}
